"""
Создайте этот прекрасный рисунок

Старайтесь для переноса строк использовать экранированный символ "\n"

Sample Input:

Sample Output:

/\_/\
>^,^<
 / \
(|_|)_/
"""

print("/\_/\\\n>^,^<\n / \\\n(|_|)_/")