"""
------------------------------------------------------------------------------------------------------------------
# На вход программе поступает целое число
#
# Ваша задача сохранить в переменную text  строку Even, если введенное число четное, иначе сохраните строку Odd
#
# В качестве ответа необходимо вывести переменную text
#
# Sample Input 1:
#
# 8
# Sample Output 1:
#
# Even
# Sample Input 2:
#
# 7
# Sample Output 2:
#
# Odd

# 1ый вариант
num = int(input())
print((text := 'Even') if num % 2 == 0 else (text := 'Odd'))

# 2ой вариант
print((text := 'Even') if int(input()) % 2 == 0 else (text := 'Odd'))

# 3ий вариант
num = int(input())
text = 'Even' if num % 2 == 0 else 'Odd'
print(text)
------------------------------------------------------------------------------------------------------------------
"""

"""
------------------------------------------------------------------------------------------------------------------
# На вход вашей программе поступает два неравных друг другу целых числа в отдельных строках
# 
# Ваша задача сохранить наименьшее из этих чисел в переменную  minimum, а наибольшее - в maximum
# 
# Использовать нужно, конечно же, тернарный оператор
# 
# В качестве ответа выведите через пробел сперва minimum , а потом maximum
# 
# Sample Input 1:
# 
# 8
# 11
# Sample Output 1:
# 
# 8 11
# Sample Input 2:
# 
# 900
# 800
# Sample Output 2:
# 
# 800 900
# Sample Input 3:
# 
# -4
# -3
# Sample Output 3:
# 
# -4 -3


# 1ый вариант
num_1, num_2 = int(input()), int(input())
maximum = num_1 if num_1 > num_2 else num_2
minimum = num_1 if num_1 < num_2 else num_2
print(minimum, maximum)

# 2ой вариант
num_1, maximum = int(input()), int(input())
print(minimum, maximum) if maximum > minimum else (maximum, minimum)

# 3ий вариант не сильно по теме, просто короче
# num = [int(input()), int(input())]
# print(min(num), max(num))
------------------------------------------------------------------------------------------------------------------
"""
