

# Мой вариант, который прошёл проверку

n = int(input("Введите число: "))
print("Первый вариант решения!!!!")
list_sta_4 = [14, 114, 214, 314, 514, 614, 714, 714, 814, 914]
list_sta_3 = [13, 113, 213, 313, 413, 513, 613, 713, 813, 913]
list_sta_2 = [12, 112, 212, 312, 412, 512, 612, 712, 812, 912]
list_st_1 = [11, 111, 211, 311, 411, 511, 611, 711, 811, 911]

if 0 <= n <= 1000:

    if (n % 10 == 1) and (n not in list_st_1):
        print(f"{n} программист")
    elif (n % 10 == 2 and n not in list_sta_2) \
            or (n % 10 == 4 and n not in list_sta_4) \
            or (n % 10 == 3 and n not in list_sta_3):
        print(f"{n} программиста")
    else:
        print(f"{n} программистов")


# Второй вариант, который подсмотрел и допелил и тоже прошёл проверку

n = int(input("Введите число: "))
print("Второй вариант решения!!!!")
if 0 <= n <= 1000:

    if n % 10 == 1 and n % 100 != 11:
        print(f"{n} программист")
    elif 2 <= n % 10 <= 4 and not 12 <= n % 100 <= 14:
        print(f"{n} программиста")
    else:
        print(f"{n} программистов")
